In [1]:
import sqlite3

In [2]:
connection = sqlite3.connect('prac.db')

cursor = connection.cursor()

In [3]:
cursor.execute(f"""CREATE TABLE Worker(
  Worker_ID INTEGER NOT NULL PRIMARY KEY AUTOINCREMENT,
  First_Name VARCHAR(25),
  Last_Name VARCHAR(25),
  Salary INT(15),
  Joining_Date DATETIME,
  Department VARCHAR(25))""")

In [4]:
cursor.execute(f"""CREATE TABLE Bonus(
 Worker_Ref_Id INT,
 Bonus_Amount INT(10),
 Bonus_Date DATETIME,
 FOREIGN KEY (Worker_Ref_Id)
 REFERENCES Worker(Worker_ID)
 ON DELETE CASCADE)""")

In [5]:
cursor.execute(f"""CREATE TABLE Title(
	Worker_Ref_Id INT,
	Worker_Title VARCHAR(25),
	Affected_From DATETIME,
	FOREIGN KEY (Worker_Ref_Id)
	REFERENCES Worker(Worker_Id)
  ON DELETE CASCADE
)""")

**Populating the database**

In [6]:
cursor.execute(f"""INSERT INTO Worker
	(Worker_Id, First_Name, Last_Name, Salary, Joining_Date, Department) VALUES
		(001, 'Monika', 'Arora', 100000, '14-02-20 09.00.00', 'HR'),
		(002, 'Niharika', 'Verma', 80000, '14-06-11 09.00.00', 'Admin'),
		(003, 'Vishal', 'Singhal', 300000, '14-02-20 09.00.00', 'HR'),
		(004, 'Amitabh', 'Singh', 500000, '14-02-20 09.00.00', 'Admin'),
		(005, 'Vivek', 'Bhati', 500000, '14-06-11 09.00.00', 'Admin'),
		(006, 'Vipul', 'Diwan', 200000, '14-06-11 09.00.00', 'Account'),
		(007, 'Satish', 'Kumar', 75000, '14-01-20 09.00.00', 'Account'),
		(008, 'Geetika', 'Chauhan', 90000, '14-04-11 09.00.00', 'Admin')
""")


cursor.execute(f"""INSERT INTO Bonus
	(WORKER_REF_ID, BONUS_AMOUNT, BONUS_DATE) VALUES
		(001, 5000, '16-02-20'),
		(002, 3000, '16-06-11'),
		(003, 4000, '16-02-20'),
		(001, 4500, '16-02-20'),
		(002, 3500, '16-06-11')
 """)


cursor.execute(f"""INSERT INTO Title
	(WORKER_REF_ID, WORKER_TITLE, AFFECTED_FROM) VALUES
 (001, 'Manager', '2016-02-20 00:00:00'),
 (002, 'Executive', '2016-06-11 00:00:00'),
 (008, 'Executive', '2016-06-11 00:00:00'),
 (005, 'Manager', '2016-06-11 00:00:00'),
 (004, 'Asst. Manager', '2016-06-11 00:00:00'),
 (007, 'Executive', '2016-06-11 00:00:00'),
 (006, 'Lead', '2016-06-11 00:00:00'),
 (003, 'Lead', '2016-06-11 00:00:00')
 """)

**Queries**

**Selecting Everything from our tables.**

In [7]:
# Worker Table
cursor.execute("select * from Worker")
results = cursor.fetchall()
for row in results:
  print(row)

(1, 'Monika', 'Arora', 100000, '14-02-20 09.00.00', 'HR')
(2, 'Niharika', 'Verma', 80000, '14-06-11 09.00.00', 'Admin')
(3, 'Vishal', 'Singhal', 300000, '14-02-20 09.00.00', 'HR')
(4, 'Amitabh', 'Singh', 500000, '14-02-20 09.00.00', 'Admin')
(5, 'Vivek', 'Bhati', 500000, '14-06-11 09.00.00', 'Admin')
(6, 'Vipul', 'Diwan', 200000, '14-06-11 09.00.00', 'Account')
(7, 'Satish', 'Kumar', 75000, '14-01-20 09.00.00', 'Account')
(8, 'Geetika', 'Chauhan', 90000, '14-04-11 09.00.00', 'Admin')

In [8]:
# Bonus Table
cursor.execute("select * from Bonus")
results = cursor.fetchall()
for row in results:
  print(row)

(1, 5000, '16-02-20')
(2, 3000, '16-06-11')
(3, 4000, '16-02-20')
(1, 4500, '16-02-20')
(2, 3500, '16-06-11')

In [9]:
# Title Table
cursor.execute("select * from Title")
results = cursor.fetchall()
for row in results:
  print(row)

(1, 'Manager', '2016-02-20 00:00:00')
(2, 'Executive', '2016-06-11 00:00:00')
(8, 'Executive', '2016-06-11 00:00:00')
(5, 'Manager', '2016-06-11 00:00:00')
(4, 'Asst. Manager', '2016-06-11 00:00:00')
(7, 'Executive', '2016-06-11 00:00:00')
(6, 'Lead', '2016-06-11 00:00:00')
(3, 'Lead', '2016-06-11 00:00:00')

In [10]:
# Write an SQL query to fetch “FIRST_NAME” from the Worker table using the alias name <WORKER_NAME>.

cursor.execute("select First_Name as Worker_Name from Worker").fetchall()

[('Monika',),
 ('Niharika',),
 ('Vishal',),
 ('Amitabh',),
 ('Vivek',),
 ('Vipul',),
 ('Satish',),
 ('Geetika',)]

In [11]:
# Write an SQL query to fetch “FIRST_NAME” from the Worker table in upper case.

cursor.execute("select upper(First_Name) from Worker").fetchall()

[('MONIKA',),
 ('NIHARIKA',),
 ('VISHAL',),
 ('AMITABH',),
 ('VIVEK',),
 ('VIPUL',),
 ('SATISH',),
 ('GEETIKA',)]

In [12]:
# Write an SQL query to fetch unique values of DEPARTMENT from the Worker table.

cursor.execute("select distinct Department from Worker").fetchall()

[('HR',), ('Admin',), ('Account',)]

In [14]:
# Write an SQL query to print the first three characters of  FIRST_NAME from the Worker table.

cursor.execute("select substring(First_Name,1,3) from Worker").fetchall()

[('Mon',),
 ('Nih',),
 ('Vis',),
 ('Ami',),
 ('Viv',),
 ('Vip',),
 ('Sat',),
 ('Gee',)]

In [17]:
# Write an SQL query to find the position of the alphabet (‘a’) in the first name column ‘Amitabh’ from the Worker table.

cursor.execute("select instr(First_Name, 'a') AS position from Worker WHERE First_Name = 'Amitabh'").fetchall()

[(5,)]

In [18]:
# Write an SQL query to print the FIRST_NAME from the Worker table after removing white spaces from the right side.

cursor.execute("select rtrim(First_Name) from Worker").fetchall()

[('Monika',),
 ('Niharika',),
 ('Vishal',),
 ('Amitabh',),
 ('Vivek',),
 ('Vipul',),
 ('Satish',),
 ('Geetika',)]

In [19]:
# Write an SQL query to print the DEPARTMENT from the Worker table after removing white spaces from the left side.

cursor.execute("select ltrim(Department) from Worker").fetchall()

[('HR',),
 ('Admin',),
 ('HR',),
 ('Admin',),
 ('Admin',),
 ('Account',),
 ('Account',),
 ('Admin',)]

In [20]:
# Write an SQL query that fetches the unique values of DEPARTMENT from the Worker table and prints its length.

cursor.execute("select distinct length(Department) from Worker").fetchall()

[(2,), (5,), (7,)]

In [22]:
# Write an SQL query to print the FIRST_NAME from the Worker table after replacing ‘a’ with ‘A’

cursor.execute("select replace(First_Name,'a','A') from Worker").fetchall()

[('MonikA',),
 ('NihArikA',),
 ('VishAl',),
 ('AmitAbh',),
 ('Vivek',),
 ('Vipul',),
 ('SAtish',),
 ('GeetikA',)]

In [30]:
# Write an SQL query to print the FIRST_NAME and LAST_NAME from the Worker table
#into a single column COMPLETE_NAME. A space char should separate them.

cursor.execute("Select First_Name || ' ' || Last_Name AS complete_name from Worker").fetchall()

[('Monika Arora',),
 ('Niharika Verma',),
 ('Vishal Singhal',),
 ('Amitabh Singh',),
 ('Vivek Bhati',),
 ('Vipul Diwan',),
 ('Satish Kumar',),
 ('Geetika Chauhan',)]